<template>
  <div class="container">
    <div class="list">
      <van-pull-refresh v-model="refreshing" @refresh="onRefresh">
        <van-list v-model="loading" :finished="finished" finished-text="没有更多了" @load="onLoad">
          <ArticleCard
            v-for="item in articles"
            :key="item.id"
            :title="item.title"
            :author="item.author"
            :time="item.time"
            :id="item.id"
            :category="category[index]"
            :context="item.context"
          ></ArticleCard>
        </van-list>
      </van-pull-refresh>
    </div>
  </div>
</template>
<script lang="ts">
import Vue from "vue";
import ArticleCard from "../../../components/ArticleCard.vue";

export default Vue.extend({
  components: {
    ArticleCard
  },
  data() {
    return {
      //上拉加载
      loading: false,
      //是否到底
      finished: false,
      //下拉刷新
      refreshing: false,
      articles: [
        {
          id: "1",
          title: "文章标题",
          author: "文章作者",
          time: "2020-04-21",
          context:
            "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
        },
        {
          id: "2",
          title: "文章标题",
          author: "文章作者",
          time: "2020-04-21",
          context:
            "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
        },
        {
          id: "3",
          title: "文章标题",
          author: "文章作者",
          time: "2020-04-21",
          context:
            "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
        },
        {
          id: "4",
          title: "文章标题",
          author: "文章作者",
          time: "2020-04-21",
          context:
            "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
        },
        {
          id: "5",
          title: "文章标题",
          author: "文章作者",
          time: "2020-04-21",
          context:
            "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
        },
        {
          id: "6",
          title: "文章标题",
          author: "文章作者",
          time: "2020-04-21",
          context:
            "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
        },
        {
          id: "7",
          title: "文章标题",
          author: "文章作者",
          time: "2020-04-21",
          context:
            "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
        },
        {
          id: "8",
          title: "文章标题",
          author: "文章作者",
          time: "2020-04-21",
          context:
            "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
        },
        {
          id: "9",
          title: "文章标题",
          author: "文章作者",
          time: "2020-04-21",
          context:
            "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
        },
        {
          id: "10",
          title: "文章标题",
          author: "文章作者",
          time: "2020-04-21",
          context:
            "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
        }
      ],
      category: [
        "js",
        "java",
        "pathon",
        "mysql",
        "cs",
        "js",
        "java",
        "pathon",
        "mysql",
        "cs"
      ],
      index: 0
    };
  },
  methods: {
    onLoad() {
      //上拉加载

      setTimeout(() => {
        if (this.refreshing) {
          console.log("刷新");
          this.articles = this.articles.splice(0, 10);
          this.refreshing = false;
          this.loading = false;
        } else {
          let len = this.articles.length;
          for (let i = 0; i < 10; i++) {
            this.articles.push({
              id: "" + (len + i + 1),
              title: "文章标题",
              author: "文章作者",
              time: "2020-04-21",
              context:
                "人生最难控制的是：情绪拿破仑曾说：“能控制好情绪的人，比能拿下一座城池的将军更伟大。”之所以更伟大，是因为人生最难控制的，就是情绪。控制情绪，不仅需要理性地看到自己的不足，还需要将心比心地顾及旁人、包容旁人，成为一个温柔又有力量的人。宋代侍郎张九成，是一名居士，平日里很喜欢品读禅学经典，但始终没法理解其中的深意。有一天，张九成去拜访当地有名的妙喜禅师。禅师问：“你来做什么？”张九成毕恭毕敬地说，自己是前来请教禅理的，以消除心中的愤懑。禅师接着问：“粗鄙之辈，参什么禅，悟什么道？”张九成一听，瞬间火冒三丈，怒气冲冲地骂道：“你个老秃驴，亏你还是个出家人，怎么说得出这样的话……”“我才轻轻这么一扇，你的火就大成这样了，还怎么参禅呢？”禅师用手势止住他，接着说:“有的人常被人轻视、被人唾骂、被人挫伤，但依旧能安然处之，是因为他们的本心既刚又柔、既深又广。能忍人之所不忍，也便能见人之所未见。控制好情绪，与人为善，张口即佛，又怎会轻易被外缘所牵动呢？”相信很多人都跟张九成感同身受，常常告诉自己，要冷静，要温和。结果一遇到事，心中便波涛汹涌，忍不住破口大骂，甚至乱发脾气，迁怒于他人。圣人老子曾说：“胜人者有力，自胜者强。”一个能控制好情绪的人，无疑就是战胜了自己弱点的人，这样的人，内心是强大到不可撼摇的。控制情绪是不易的，可一旦做到了，一生会少了无数的是非纠葛，多了许多鲜活自在的时光。"
            });
          }

          this.loading = false;

          if (this.articles.length >= 100) {
            this.finished = true;
          }
        }
      }, 1000);
    },
    onRefresh() {
      // 清空列表数据
      this.finished = false;

      // 重新加载数据
      // 将 loading 设置为 true，表示处于加载状态
      this.loading = true;
      this.onLoad();
    }
  },
  mounted() {
    this.index = parseInt(this.$route.params.category);
  }
});
</script>

<style>
.container {
  /* background-color: red; */
  /* height: 50%;
  overflow: scroll; */
}

.container .list {
  position: relative;
  margin-top: 5rem;
  margin-left: 0;
  margin-bottom: 4.5rem;
  width: 100%;
  height: 30%;
}

.container .list .ArticleCard {
  left: 0;
  margin-top: 15px;
}
</style>
